load_test_results/10000_users.txt
Bombarding http://localhost:8080/api/game/submit with 100000 request(s) using 10000 connection(s)
 100000 / 100000 [=================================================================================================================================================================] 100.00% 438/s 3m48s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      3695.21   12562.42  123298.29
  Latency        19.37s     26.77s      2.39m
  HTTP codes:
    1xx - 0, 2xx - 46242, 3xx - 0, 4xx - 0, 5xx - 724
    others - 53034
  Errors:
       timeout - 53034
  Throughput:   132.45KB/s