load_test_results/1000_users.txt
Bombarding http://localhost:8080/api/game/submit with 10000 request(s) using 1000 connection(s)
 10000 / 10000 [=====================================================================================================================================================================] 100.00% 2549/s 3s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      3496.14    9063.11  106600.13
  Latency      372.42ms   173.57ms      0.94s
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.06MB/s