load_test_results/100_users.txt
Bombarding http://localhost:8080/api/game/submit with 1000 request(s) using 100 connection(s)
 1000 / 1000 [=======================================================================================================================================================================] 100.00% 1643/s 0s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      1691.32    1351.44    4938.53
  Latency       57.24ms    23.39ms   120.54ms
  HTTP codes:
    1xx - 0, 2xx - 1000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   667.89KB/s