load_test_results/10_users.txt
Bombarding http://localhost:8080/api/game/submit with 100 request(s) using 10 connection(s)
 100 / 100 [==========================================================================================================================================================================] 100.00% 498/s 0s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       643.78     352.04    1174.58
  Latency       14.57ms     6.76ms    31.78ms
  HTTP codes:
    1xx - 0, 2xx - 100, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   272.19KB/s