load_test_results/2000_users.txt
Bombarding http://localhost:8080/api/game/submit with 20000 request(s) using 2000 connection(s)
 20000 / 20000 [=====================================================================================================================================================================] 100.00% 8396/s 2s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     11052.87   14552.93   72027.94
  Latency      220.04ms   198.10ms      1.08s
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 20000
  Errors:
    dial tcp [::1]:8080: connect: connection refused - 20000
  Throughput:       0.00/s