load_test_results/2000_users_final.txt
Bombarding http://localhost:8080/api/game/submit with 20000 request(s) using 2000 connection(s)
 20000 / 20000 [=====================================================================================================================================================================] 100.00% 7080/s 2s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      9327.96    9708.42   42141.04
  Latency      255.50ms   726.00ms      2.62s
  HTTP codes:
    1xx - 0, 2xx - 18048, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1952
  Errors:
       timeout - 1952
  Throughput:     2.83MB/s