load_test_results/200_users.txt
Bombarding http://localhost:8080/api/game/submit with 2000 request(s) using 200 connection(s)
 2000 / 2000 [=======================================================================================================================================================================] 100.00% 1956/s 1s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      2474.09    3484.41   22680.52
  Latency       97.76ms    48.95ms   257.17ms
  HTTP codes:
    1xx - 0, 2xx - 2000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   834.35KB/s