load_test_results/4000_users.txt
Bombarding http://localhost:8080/api/game/submit with 40000 request(s) using 4000 connection(s)
 40000 / 40000 [====================================================================================================================================================================] 100.00% 17504/s 2s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     25395.09   32163.14  211292.04
  Latency      185.56ms   165.69ms      0.99s
  HTTP codes:
    1xx - 0, 2xx - 40000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.55MB/s