load_test_results/400_users.txt
Bombarding http://localhost:8080/api/game/submit with 4000 request(s) using 400 connection(s)
 4000 / 4000 [=======================================================================================================================================================================] 100.00% 1645/s 2s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      2271.80    6538.72   64973.92
  Latency      218.19ms    93.38ms   432.16ms
  HTTP codes:
    1xx - 0, 2xx - 4000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   745.46KB/s