load_test_results/6000_users.txt
Bombarding http://localhost:8080/api/game/submit with 60000 request(s) using 6000 connection(s)
 60000 / 60000 [====================================================================================================================================================================] 100.00% 14573/s 4s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     19213.73   26347.83  174531.89
  Latency      380.11ms   414.42ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 59999, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1
  Errors:
       timeout - 1
  Throughput:     5.69MB/s