load_test_results/600_users.txt
Bombarding http://localhost:8080/api/game/submit with 6000 request(s) using 600 connection(s)
 6000 / 6000 [=======================================================================================================================================================================] 100.00% 2243/s 2s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      2309.61    2924.17   13895.02
  Latency      254.23ms   135.67ms   700.91ms
  HTTP codes:
    1xx - 0, 2xx - 6000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     0.93MB/s