load_test_results/8000_users.txt
Bombarding http://localhost:8080/api/game/submit with 80000 request(s) using 8000 connection(s)
 80000 / 80000 [====================================================================================================================================================================] 100.00% 13160/s 6s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     16732.60   20967.60  144923.86
  Latency      562.18ms   527.19ms      3.46s
  HTTP codes:
    1xx - 0, 2xx - 78806, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1194
  Errors:
       timeout - 1194
  Throughput:     5.28MB/s