load_test_results/800_users.txt
Bombarding http://localhost:8080/api/game/submit with 8000 request(s) using 800 connection(s)
 8000 / 8000 [=======================================================================================================================================================================] 100.00% 2539/s 3s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      3060.67    4023.64   19393.41
  Latency      289.48ms   122.34ms   790.80ms
  HTTP codes:
    1xx - 0, 2xx - 8000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.06MB/s